app/Controllers/UserController.php

    public function fetchUsers(){
        $loggedInUserId =   session()->get('id');
        $users = $this->UserModel->where('role !=', 'superadmin')
        ->where('id !=', $loggedInUserId)
        ->findAll();
---
SELECT *
FROM `users`
WHERE `role` != 'superadmin'
AND `id` IS NOT NULL

    public function loginValidate()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $rememberMe = $this->request->getPost('rememberMe');

        $result = $this->UserModel->where(['email'=>$email])->get()->getResult();
---
SELECT *
FROM `users`
WHERE `email` = 'testuserss@gmail.com'

    public function profile()
    {

        $userId = session()->get('id');
        $user = $this->UserModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '10'