app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function fetchUsers(){

        $users = $this->UserModel->findAll();

SELECT *
FROM `users`
WHERE `email` = 'digi_admin@gmail.com'
---
    public function loginValidate()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $rememberMe = $this->request->getPost('rememberMe');

        $result = $this->UserModel->where(['email'=>$email])->get()->getResult();